; ==============================================================================
; Hollis-Bit's OS — Точка входа 64-битного ядра на Ассемблере
; Файл: src/kernel/entry.asm
; Архитектура: x86_64 Long Mode (адрес загрузки 0x100000 = 1 МБ)
; ==============================================================================

[bits 64]

global _start
extern kmain

section .text

_start:
    ; 1. Настройка 64-битного указателя стека ядра
    mov rsp, 0x90000

    ; 2. Передача управления в 64-битный модуль ядра на Zig (kmain)
    call kmain

    ; 3. Защитный цикл на случай неожиданного возврата из kmain
.halt:
    hlt
    jmp .halt
